Documents/МегаЛогист_МаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>МегаЛогист_МаршрутныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АТ_ПолученныеДеньгиОтВодителей</xr:Item>
				<xr:Item>AccumulationRegister.АТ_МаршрутныеЗаданияЗатраты</xr:Item>
				<xr:Item>AccumulationRegister.АТ_ТранспортныеЗатраты</xr:Item>
				<xr:Item>AccumulationRegister.МегаЛогист_ВзаиморасчетыСКурьерами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыМаршрутногоЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыдано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКПолучению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПотрачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНевыполненно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяСтоимостьРейса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыйПробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяПродолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяПродолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АТ_ЗонаРейса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаршрутныеЗадания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МаршрутноеЗадание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядкаОбъезда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АТ_СуммаРейса</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АТ_ПолученаСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/МегаЛогист_СохраненныеАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>МегаЛогист_СохраненныеАдреса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МегаЛогист_СтатусыМаршрутногоЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>МегаЛогист_СтатусыМаршрутногоЗадания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КРаспределению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МегаЛогист_Маркеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>МегаЛогист_Маркеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер1</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер2</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер3</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТССОреолом</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПешийКурьер</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПешийСОреолом</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветПолиЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/МегаЛогист_МаршрутныйЛист/Forms/ФормаЗЛ/Ext/Form/Module.bsl
Функция ПолучитьМассивАдресов(ДокументСсылка)

	Обработка = Обработки.МегаЛогист_РабочееМестоЛогиста.Создать();
	СписокАдресов = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из ДокументСсылка.МаршрутныеЗадания Цикл
		
		Если НачалоДня(ДокументСсылка.ДатаОтправки) = НачалоДня(СтрокаТЧ.МаршрутноеЗадание.ДатаДоставки) 
			И СтрокаТЧ.МаршрутноеЗадание.Статус <> Перечисления.МегаЛогист_СтатусыМаршрутногоЗадания.Отменено
			И Не СтрокаТЧ.МаршрутноеЗадание.ПометкаУдаления  Тогда
			
			Если МегаЛогист_Общий.ЭтоПроблемноеМЗ(СтрокаТЧ.МаршрутноеЗадание) тогда
				Продолжить;
			КонецЕсли;	
			
			СписокАдресов.Добавить(СтрокаТЧ.НомерСтроки, Обработка.ПривестиАдресДляПоиска(СтрокаТЧ.МаршрутноеЗадание.АдресДоставки, СтрокаТЧ.МаршрутноеЗадание.АдресДоставкиЗначенияПолей));
		
		КонецЕсли;
	
	КонецЦикла;

	Возврат СписокАдресов;
КонецФункции // ПолучитьМассивАдресов()


&НаКлиенте
Процедура ПечатьДокумента(Команда) //печать по кнопке в режиме отладки
	
	//КартаHTML.Печать();
	Элементы.КартаHTML.Документ.parentWindow.print();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтактнуюИнформацию(Объект, ТипИнформации = Неопределено, ВидИнформации = Неопределено)
	
	текКонструктор = Новый ПостроительЗапроса;
	текКонструктор.Текст =
	"ВЫБРАТЬ
	|	тбИнформация.Представление,
	|	тбИнформация.Ссылка Как КонтИнформация,
	|   тбИнформация.Вид,
	|	тбИнформация.Тип.Порядок КАК ТипПорядок
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК тбИнформация
	|ГДЕ
	|	тбИнформация.Ссылка = &Ссылка
	|	И тбИнформация.Тип В(&Типы)
	|{ГДЕ
	|	тбИнформация.Вид.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	тбИнформация.Представление,
	|	тбИнформация.Ссылка Как КонтИнформация,
	|   тбИнформация.Вид,
	|	тбИнформация.Тип.Порядок
	|ИЗ
	|	Справочник.усКонтрагенты.КонтактнаяИнформация КАК тбИнформация
	|ГДЕ
	|	тбИнформация.Ссылка = &Ссылка
	|	И тбИнформация.Тип В(&Типы)
	|{ГДЕ
	|	тбИнформация.Вид.*}
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипПорядок
	|";
	
	мсвТипыКИ = Новый Массив;
	Если ЗначениеЗаполнено(ТипИнформации) тогда
		мсвТипыКИ.Добавить(ТипИнформации);
	Иначе	
		мсвТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
		//мсвТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		//мсвТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Факс);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидИнформации) тогда
		текЭлемент = текКонструктор.Отбор.Добавить("Вид");
		текЭлемент.ВидСравнения  = ВидСравнения.ВСписке;
		текЭлемент.Значение      = ВидИнформации;
		текЭлемент.Использование = Истина;
	КонецЕсли;
	
	текКонструктор.Параметры.Вставить("Ссылка", Объект);
	текКонструктор.Параметры.Вставить("Типы", мсвТипыКИ);
	
	текКонструктор.Выполнить();
	текВыборка = текКонструктор.Результат.Выбрать();
	
	текПредставление = "";
	Пока текВыборка.Следующий() Цикл
		текПредставление = текПредставление +?(ПустаяСтрока(текПредставление), "", ", ") + СокрЛП(текВыборка.Представление);
	КонецЦикла;
	
	Возврат текПредставление;
	
КонецФункции

// Функция формирует печатную форму документа.
//
// Параметры:
//  Тип - Строка - тип печатной формы: Рейс
//  МассивОбъектов - Массив - массив документов для печати
//  ОбъектыПечати - СписокЗначений
//
// Возвращаемое значение:
//  ТабличныйДокумент
//
&НаСервере
Функция СформироватьПечатнуюФормуЗагрузочныйЛист(МассивОбъектов, ОбъектыПечати,Макет)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Возврат ТабДок;	
	
КонецФункции // СформироватьПечатнуюФорму()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если Не ВебКлиент Тогда
	///////////////////////////////////////////
	//Мироненко Д.С 25.10.2016 11:18:10 НАЧАЛО
	//Комментарий: Отключение получения на сервере
	
	////получим архив
	//Каталог = КаталогВременныхФайлов();
	//Архив = Обработки.МегаЛогист_РабочееМестоЛогиста.ПолучитьМакет("Исходники");
	//Архив.Записать(Каталог + "arj.zip");
	//ЧтениеАрхива = Новый ЧтениеZipФайла(Каталог + "arj.zip");
	//ЧтениеАрхива.ИзвлечьВсе(Каталог+"source2");
	//КартаHTML = Каталог+"source2\leaflet.html";
	//
	////Запишем маркера по-умолчанию
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	Маркеры.Ссылка
	//               |ИЗ
	//               |	Справочник.МегаЛогист_Маркеры КАК Маркеры
	//               |ГДЕ
	//               |	Маркеры.ПоУмолчанию = ИСТИНА";
	//	
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	Маркер = Выборка.Ссылка.ПолучитьОбъект();
	//	Картинка = Маркер.Маркер1.Получить();
	//	Картинка.Записать(КаталогВременныхФайлов() + "source2\" + "default1.png");
	//	Картинка = Маркер.Маркер2.Получить();
	//	Картинка.Записать(КаталогВременныхФайлов() + "source2\" + "default2.png");
	//
	//КонецЕсли;
	
	//Мироненко Д.С 25.10.2016 11:18:19 КОНЕЦ
	///////////////////////////////////////////	
	#КонецЕсли
	ЗадержкаОтправкиЗапроса = ?(Константы.МегаЛогист_ЗадержкаОтправкиЗапроса.Получить() = 0, 0.1, Константы.МегаЛогист_ЗадержкаОтправкиЗапроса.Получить());
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКарты()

	#Если Не ВебКлиент Тогда
	//получим архив
	Каталог = КаталогВременныхФайлов();
	Архив = Обработки.МегаЛогист_РабочееМестоЛогиста.ПолучитьМакет("Исходники");
	Архив.Записать(Каталог + "arj.zip");
	ЧтениеАрхива = Новый ЧтениеZipФайла(Каталог + "arj.zip");
	ЧтениеАрхива.ИзвлечьВсе(Каталог+"source2");
	КартаHTML = Каталог+"source2\leaflet.html";
	
	//Запишем маркера по-умолчанию
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Маркеры.Ссылка
	|ИЗ
	|	Справочник.МегаЛогист_Маркеры КАК Маркеры
	|ГДЕ
	|	Маркеры.ПоУмолчанию = ИСТИНА";
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Маркер = Выборка.Ссылка.ПолучитьОбъект();
		Картинка = Маркер.Маркер1.Получить();
		Картинка.Записать(КаталогВременныхФайлов() + "source2\" + "default1.png");
		Картинка = Маркер.Маркер2.Получить();
		Картинка.Записать(КаталогВременныхФайлов() + "source2\" + "default2.png");
	
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуИнициализацииСервер()

	Обработка = Обработки.МегаЛогист_РабочееМестоЛогиста.Создать();
	Возврат Обработка.ПолучитьСтрокуИнициализации();

КонецФункции

// Убирает из строки адреса не нужные данные: индекс, дом, №, г
//
// Параметры
//  СтрокаАдреса  - Строка - исходная строка
//
// Возвращаемое значение:
//   Строка   - Очищенная строка
//
Функция ПривестиАдресДляПоиска(Знач СтрокаАдреса)

	ВозможноИндекс = Лев(СтрокаАдреса, 6);
	Попытка
	
		ВремПеременная = Число(ВозможноИндекс);
		//Если отработало то это число
		СтрокаАдреса = Прав(СтрокаАдреса, СтрДлина(СтрокаАдреса) - 6);
	Исключение
	
	КонецПопытки;
	СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "г,", "");
	СтрокаАдреса = СтрЗаменить(СтрокаАдреса, ",", "");
	СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "№", "");
	СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "дом", "");
	СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "г.", "");
	Возврат СтрокаАдреса;

КонецФункции // ПривестиАдресДляПоиска()

&НаКлиенте 
Процедура ЦиклПереносаНаКарту()

	Если СписокКПереносуНаКарту.Количество() > 0 Тогда
		
		Стр = Число(СписокКПереносуНаКарту[0].Значение);
		СтрокаТаблицы = СписокКПереносуНаКарту[0].Представление;
		СписокКПереносуНаКарту.Удалить(0);
	
	Иначе
	
		Возврат;
	
	КонецЕсли;
	
	Попытка
		
		//Элементы.КартаHTML.Документ.parentWindow.map_addMarkerForAddr(
		//Стр, 
		//"" + СтрокаТаблицы, 
		//"Доставка до клиента", 
		//"default1.png");
		//Элементы.КартаHTML.Документ.parentWindow.map_addMarkerForAddr(
		//		Стр,
		//		"" + Стр,
		//		"",
		//		"",
		//		"" + СтрокаТаблицы, 
		//		"Доставка до клиента", 
		//		"default1.png");
		
		СтрокаТаблицы = Новый Структура("АдресДоставкиПриведенный, ТипЗадания", СтрокаТаблицы, "Доставка до клиента");
		СтруктураВозврата = ПроверитьВнесениеАдреса(СтрокаТаблицы.АдресДоставкиПриведенный);
		Если СтруктураВозврата = Неопределено Тогда
			МегаЛогист_Служебный.ДобавитьМаркерАдрес(	Элементы, 
												СтрокаТаблицы, 
												Стр, 
												"default1.png");
		Иначе
			МегаЛогист_Служебный.ДобавитьМаркерЛокация(	Элементы, 
														СтруктураВозврата, 
														СтрокаТаблицы, 
														Стр);
												
		КонецЕсли;									
		//Сообщить("Вывод");
	Исключение
		
		Сообщить("Ошибка: " + ОписаниеОшибки());
		
	КонецПопытки;
	
	ПодключитьОбработчикОжидания("ЦиклПереносаНаКарту", ЗадержкаОтправкиЗапроса, Истина);

КонецПроцедуры

&НаСервере 
// производится проверка переданного адреса по регистру "Сохраненные адреса"
//
// Параметры
//  Адрес - Строка
//
// Возвращаемое значение:
//   Структура   - структура возврата
//
Функция ПроверитьВнесениеАдреса(Адрес)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МегаЛогист_СохраненныеАдреса.Широта,
	|	МегаЛогист_СохраненныеАдреса.Долгота
	|ИЗ
	|	РегистрСведений.МегаЛогист_СохраненныеАдреса КАК МегаЛогист_СохраненныеАдреса
	|ГДЕ
	|	МегаЛогист_СохраненныеАдреса.ПредставлениеАдреса = &ПредставлениеАдреса";
	
	Запрос.УстановитьПараметр("ПредставлениеАдреса", Адрес);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Новый Структура("Широта, Долгота", Выборка.Широта, Выборка.Долгота)
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 	

КонецФункции // ПроверитьВнесениеАдреса()

&НаСервере
Функция ПолучитьСтатус(ДокументОснование)

	Возврат ?(	ДокументОснование.Статус = Перечисления.МегаЛогист_СтатусыМаршрутногоЗадания.Выполнено 
				ИЛИ ДокументОснование.Статус = Перечисления.МегаЛогист_СтатусыМаршрутногоЗадания.НеВыполнено
				ИЛИ ДокументОснование.Статус = Перечисления.МегаЛогист_СтатусыМаршрутногоЗадания.Отменено, "" + ДокументОснование.Статус, "");

КонецФункции // ПолучитьСтатус()

&НаСервере
Функция ПолучитьЦветМаркераСервер(ДокументОснование)
	
	Статус = ДокументОснование.Статус;
	Если Статус = Перечисления.МегаЛогист_СтатусыМаршрутногоЗадания.НеВыполнено ИЛИ Статус = Перечисления.МегаЛогист_СтатусыМаршрутногоЗадания.Отменено Тогда
		Возврат "cancel";
	Иначе
		Возврат "done";
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура КартаHTMLДокументСформирован(Элемент)
	
	Если Не ПервыйВызов Тогда
	
		ПервыйВызов = Истина;
		Возврат;
	
	КонецЕсли; 
	
	Попытка
		Если Не КартаИнициализирована Тогда
			
			СтрокаИнициализации = ПолучитьСтрокуИнициализацииСервер();
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаИнициализации, ",", Истина);
			Если МассивСтрок.Количество() <> 25 Тогда
			
				Сообщить("Карта не может быть отображена. Проверьте настройки инициализации карты");
				Возврат;
			
			КонецЕсли;
			МегаЛогист_Служебный.Инициализация(Элементы, МассивСтрок, ПолучитьИмяГеокодера(), ПолучитьКлючАПИ());
			КартаИнициализирована = Истина;

			//Вместо массива вернем список
			//МассивАдресов = ПолучитьМассивАдресов(МаршрутныйЛист);
			СписокКПереносуНаКарту = ПолучитьМассивАдресов(МаршрутныйЛист);
			
			//Стр = 1;
			//Для каждого СтрокаТаблицы Из МассивАдресов Цикл
			//	
			//	СписокКПереносуНаКарту.Добавить(Стр, СтрокаТаблицы);
			//	Стр = Стр + 1;
			//	
			//КонецЦикла;
			
			ПодключитьОбработчикОжидания("ЦиклПереносаНаКарту", ЗадержкаОтправкиЗапроса, Истина);
			
		КонецЕсли;
	Исключение
	
	КонецПопытки;
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьИмяГеокодера()
	
	Обработка = Обработки.МегаЛогист_РабочееМестоЛогиста.Создать();
	Возврат Обработка.ПолучитьИмяГеокодера()

КонецФункции

&НаСервере
Функция ПолучитьКлючАПИ()

	Возврат МегаЛогист_Служебный.ПолучитьКлючАПИ();

КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		
		КартаHTML = "<!DOCTYPE html>
                     |<html>
                     |<head>
                     |	<title>Map Leaflet</title>
                     |	<meta charset=""utf-8"" />
                     |	<meta http-equiv=""X-UA-Compatible"" content=""IE=8"" >
                     |
                     |
                     |	<script type=''text/javascript''>
					 |		window.onload = function(){ window.open('" + ПолучитьАдресПубликации() + "/leaflet_web_2.html', '_self'); }
                     |
                     |	</script>
                     |</head>
                     |<body>
                     |
                     |</body>
                     |</html>";
					 
	#Иначе
		//получим архив
		Каталог = КаталогВременныхФайлов();
		
		//Архив = Обработка.ПолучитьМакет("Исходники");
		//Архив.Записать(Каталог + "arj.zip");
		
		Адрес = ПолучитьФайлНаСервере("Исходники", ЭтаФорма.УникальныйИдентификатор,,Отказ);
		Если Отказ тогда
			Возврат;
		КонецЕсли;	
		Описание=Новый ОписаниеПередаваемогоФайла(Каталог + "arj.zip", Адрес);
		МассивОписаний=Новый Массив;
		МассивОписаний.Добавить(Описание);
		ПолучитьФайлы(МассивОписаний,,,Ложь);
		ЧтениеАрхива = Новый ЧтениеZipФайла(Каталог + "arj.zip");
		ЧтениеАрхива.ИзвлечьВсе(Каталог+"source");
		КартаHTML = Каталог+"source\leaflet.html";
		
		Адрес = ПолучитьФайлНаСервере("МаркерыПоУмолчанию", ЭтаФорма.УникальныйИдентификатор, "Маркер1",Отказ);
		Если Отказ тогда
			Возврат;
		КонецЕсли;	
		Описание=Новый ОписаниеПередаваемогоФайла(Каталог + "source\" + "default1.png", Адрес);
		МассивОписаний=Новый Массив;
		МассивОписаний.Добавить(Описание);
		ПолучитьФайлы(МассивОписаний,,,Ложь);

		Адрес = ПолучитьФайлНаСервере("МаркерыПоУмолчанию", ЭтаФорма.УникальныйИдентификатор, "Маркер2",Отказ);
		Если Отказ тогда
			Возврат;
		КонецЕсли;
		Описание=Новый ОписаниеПередаваемогоФайла(Каталог + "source\" + "default2.png", Адрес);
		МассивОписаний=Новый Массив;
		МассивОписаний.Добавить(Описание);
		ПолучитьФайлы(МассивОписаний,,,Ложь);
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Функция ПолучитьФайлНаСервере(СтрокаПоиска, Идентификатор, ИмяРеквизита = "",Отказ)
	
	Возврат ВернутьФайл(СтрокаПоиска, Идентификатор, ИмяРеквизита,Отказ);
	
КонецФункции

#Область СлужебныеПроцедуры
// Получает имя файла в зависимости от переданного параметра
//
&НаСервере
Функция ВернутьФайл(Файл, Идентификатор, ИмяРеквизита = "",Отказ) Экспорт 
	
	#Если Вебклиент Тогда
		ПодключитьРасширениеРаботыСФайлами();
	#КонецЕсли
	
	Каталог 	= КаталогВременныхФайлов();
	Если Файл = "Исходники" Тогда
		
		Если МегаЛогист_Служебный.Проверка() тогда
			Отказ=Истина;
			Возврат "";
		КонецЕсли;

		Архив 		=  Обработки.МегаЛогист_РабочееМестоЛогиста.ПолучитьМакет("Исходники");
		Архив.Записать("" + Каталог + "arj.zip");
		Двоичное 	= Новый ДвоичныеДанные(Каталог + "arj.zip");
		Адрес 		= ПоместитьВоВременноеХранилище(Двоичное, Идентификатор);
		Возврат Адрес;
	
	ИначеЕсли Файл = "МаркерыПоУмолчанию" Тогда
	
		//Запишем маркера по-умолчанию
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МегаЛогист_Маркеры.Ссылка
		|ИЗ
		|	Справочник.МегаЛогист_Маркеры КАК МегаЛогист_Маркеры
		|ГДЕ
		|	МегаЛогист_Маркеры.ПоУмолчанию = ИСТИНА";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Маркер = Выборка.Ссылка.ПолучитьОбъект();
			Картинка = Маркер[ИмяРеквизита].Получить();
			Если Картинка=Неопределено тогда
				Сообщить("Некорректно заполнен маркер по ""По умолчанию""");
				Отказ=Истина;
				Возврат "";		
			КонецЕсли;	
			Картинка.Записать("" + Каталог + "default.png");
			Двоичное 	= Новый ДвоичныеДанные(Каталог + "default.png");
			Адрес 		= ПоместитьВоВременноеХранилище(Двоичное, Идентификатор);
			Возврат Адрес;
			
		иначе
			Сообщить("Назначьте одному из элементов справочника ""Маркеры"" признак ""По умолчанию""");
			Отказ=Истина;
			Возврат "";	
		КонецЕсли;
	
	КонецЕсли;
	

КонецФункции // ПолучитьФайл()

#КонецОбласти

&НаСервере 
Функция ПолучитьАдресПубликации()
	Возврат Константы.МегаЛогист_АдресВебПубликации.Получить();
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	МегаЛогист_Служебный.ОчиститьКарту(Элементы);
	СписокКПереносуНаКарту = ПолучитьМассивАдресов(МаршрутныйЛист);
	ПодключитьОбработчикОжидания("ЦиклПереносаНаКарту", ЗадержкаОтправкиЗапроса, Истина);
КонецПроцедуры
